apache/nuttx/arch/arm/src/stm32f7/stm32_otgdev.c
/****************************************************************************
 * arch/arm/src/stm32f7/stm32_otgdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "stm32_gpio.h"
#include "stm32_otg.h"
#include "stm32_rcc.h"
#include "arm_internal.h"

#if defined(CONFIG_USBDEV) && (defined(CONFIG_STM32_OTGFS) || \
    defined(CONFIG_STM32_OTGFSHS))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#  ifndef CONFIG_USBDEV_EP0_MAXSIZE
#    define CONFIG_USBDEV_EP0_MAXSIZE 64
#  endif

#  ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#    define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#  endif

#  ifndef CONFIG_USBDEV_MAXPOWER
#    define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#  endif

/* There is 1.25Kb of FIFO memory.  The default partitions this memory
 * so that there is a TxFIFO allocated for each endpoint and with more
 * memory provided for the common RxFIFO.  A more knowledge-able
 * configuration would not allocate any TxFIFO space to OUT endpoints.
 */

#  ifndef CONFIG_USBDEV_RXFIFO_SIZE
#    define CONFIG_USBDEV_RXFIFO_SIZE \
       (STM32_OTG_FIFO_SIZE - \
        STM32_OTG_FIFO_SIZE / 4/ 2 / STM32_NENDPOINTS * 4 * STM32_NENDPOINTS)
#  endif

#  if STM32_NENDPOINTS > 0
#    ifndef CONFIG_USBDEV_EP0_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP0_TXFIFO_SIZE \
          ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP0_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 1
#    ifndef CONFIG_USBDEV_EP1_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP1_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP1_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 2
#    ifndef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP2_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP2_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 3
#    ifndef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP3_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP3_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 4
#    ifndef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP4_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP4_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 5
#    ifndef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP5_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP5_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 6
#    ifndef CONFIG_USBDEV_EP6_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP6_TXFIFO_SIZE (\
         (STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP6_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 7
#    ifndef CONFIG_USBDEV_EP7_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP7_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP7_TXFIFO_SIZE 0
#  endif

#  if STM32_NENDPOINTS > 8
#    ifndef CONFIG_USBDEV_EP8_TXFIFO_SIZE
#      define CONFIG_USBDEV_EP8_TXFIFO_SIZE \
         ((STM32_OTG_FIFO_SIZE - CONFIG_USBDEV_RXFIFO_SIZE) / STM32_NENDPOINTS)
#    endif
#  else
#    define CONFIG_USBDEV_EP8_TXFIFO_SIZE 0
#  endif

/* The actual FIFO addresses that we use must be aligned to 4-byte
 * boundaries;
 * FIFO sizes must be provided in units of 32-bit words.
 */

#  define STM32_RXFIFO_BYTES     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) & ~3)
#  define STM32_RXFIFO_WORDS     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) >> 2)

#  define STM32_EP0_TXFIFO_BYTES ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP0_TXFIFO_WORDS ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP1_TXFIFO_BYTES ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP1_TXFIFO_WORDS ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP2_TXFIFO_BYTES ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP2_TXFIFO_WORDS ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP3_TXFIFO_BYTES ((CONFIG_USBDEV_EP3_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP3_TXFIFO_WORDS ((CONFIG_USBDEV_EP3_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP4_TXFIFO_BYTES ((CONFIG_USBDEV_EP4_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP4_TXFIFO_WORDS ((CONFIG_USBDEV_EP4_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP5_TXFIFO_BYTES ((CONFIG_USBDEV_EP5_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP5_TXFIFO_WORDS ((CONFIG_USBDEV_EP5_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP6_TXFIFO_BYTES ((CONFIG_USBDEV_EP6_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP6_TXFIFO_WORDS ((CONFIG_USBDEV_EP6_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP7_TXFIFO_BYTES ((CONFIG_USBDEV_EP7_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP7_TXFIFO_WORDS ((CONFIG_USBDEV_EP7_TXFIFO_SIZE + 3) >> 2)

#  define STM32_EP8_TXFIFO_BYTES ((CONFIG_USBDEV_EP8_TXFIFO_SIZE + 3) & ~3)
#  define STM32_EP8_TXFIFO_WORDS ((CONFIG_USBDEV_EP8_TXFIFO_SIZE + 3) >> 2)

#  if (STM32_RXFIFO_BYTES + \
     STM32_EP0_TXFIFO_BYTES + STM32_EP1_TXFIFO_BYTES + STM32_EP2_TXFIFO_BYTES + STM32_EP3_TXFIFO_BYTES + \
     STM32_EP4_TXFIFO_BYTES + STM32_EP5_TXFIFO_BYTES + STM32_EP6_TXFIFO_BYTES + STM32_EP7_TXFIFO_BYTES + CONFIG_USBDEV_EP8_TXFIFO_SIZE   \
    ) > STM32_OTG_FIFO_SIZE
#    error "FIFO allocations exceed FIFO memory size"
#  endif

#  define OTG_GINT_RESERVED_FS   (OTG_GINT_RES89    | \
                                OTG_GINT_RES1617  | \
                                OTG_GINT_RES22)

#  define OTG_GINT_RESERVED_HS   (OTG_GINT_RES89    | \
                                OTG_GINT_RES1617  | \
                                OTG_GINT_RES23    | \
                                OTG_GINT_RES27)

#  define OTG_GINT_RC_W1_FS      (OTG_GINT_MMIS     | \
                                OTG_GINT_SOF      | \
                                OTG_GINT_ESUSP    | \
                                OTG_GINT_USBSUSP  | \
                                OTG_GINT_USBRST   | \
                                OTG_GINT_ENUMDNE  | \
                                OTG_GINT_ISOODRP  | \
                                OTG_GINT_EOPF     | \
                                OTG_GINT_IISOIXFR | \
                                OTG_GINT_IISOOXFR | \
                                OTG_GINT_RSTDET   | \
                                OTG_GINT_LPMINT   | \
                                OTG_GINT_CIDSCHG  | \
                                OTG_GINT_DISC     | \
                                OTG_GINT_SRQ      | \
                                OTG_GINT_WKUP)

