apache/nuttx/arch/arm/src/stm32f7/stm32_otgdev.c
#  define OTG_GINT_RC_W1_HS      (OTG_GINT_MMIS     | \
                                OTG_GINT_SOF      | \
                                OTG_GINT_ESUSP    | \
                                OTG_GINT_USBSUSP  | \
                                OTG_GINT_USBRST   | \
                                OTG_GINT_ENUMDNE  | \
                                OTG_GINT_ISOODRP  | \
                                OTG_GINT_EOPF     | \
                                OTG_GINT_IISOIXFR | \
                                OTG_GINT_IISOOXFR | \
                                OTG_GINT_DATAFSUSP| \
                                OTG_GINT_CIDSCHG  | \
                                OTG_GINT_DISC     | \
                                OTG_GINT_SRQ      | \
                                OTG_GINT_WKUP)

/* Only stm32F723 has internal ULPI. We consider in HS only if a ULPI is
 * present
 */

#  ifdef CONFIG_STM32_OTGFSHS
#    define OTG_GINT_RESERVED     OTG_GINT_RESERVED_HS
#    define OTG_GINT_RC_W1        OTG_GINT_RC_W1_HS
#  else
#    define OTG_GINT_RESERVED     OTG_GINT_RESERVED_FS
#    define OTG_GINT_RC_W1        OTG_GINT_RC_W1_FS
#  endif

/* Debug ********************************************************************/

/* Trace error codes */

#  define STM32_TRACEERR_ALLOCFAIL            0x01
#  define STM32_TRACEERR_BADCLEARFEATURE      0x02
#  define STM32_TRACEERR_BADDEVGETSTATUS      0x03
#  define STM32_TRACEERR_BADEPNO              0x04
#  define STM32_TRACEERR_BADEPGETSTATUS       0x05
#  define STM32_TRACEERR_BADGETCONFIG         0x06
#  define STM32_TRACEERR_BADGETSETDESC        0x07
#  define STM32_TRACEERR_BADGETSTATUS         0x08
#  define STM32_TRACEERR_BADSETADDRESS        0x09
#  define STM32_TRACEERR_BADSETCONFIG         0x0a
#  define STM32_TRACEERR_BADSETFEATURE        0x0b
#  define STM32_TRACEERR_BADTESTMODE          0x0c
#  define STM32_TRACEERR_BINDFAILED           0x0d
#  define STM32_TRACEERR_DISPATCHSTALL        0x0e
#  define STM32_TRACEERR_DRIVER               0x0f
#  define STM32_TRACEERR_DRIVERREGISTERED     0x10
#  define STM32_TRACEERR_EP0NOSETUP           0x11
#  define STM32_TRACEERR_EP0SETUPSTALLED      0x12
#  define STM32_TRACEERR_EPINNULLPACKET       0x13
#  define STM32_TRACEERR_EPINUNEXPECTED       0x14
#  define STM32_TRACEERR_EPOUTNULLPACKET      0x15
#  define STM32_TRACEERR_EPOUTUNEXPECTED      0x16
#  define STM32_TRACEERR_INVALIDCTRLREQ       0x17
#  define STM32_TRACEERR_INVALIDPARMS         0x18
#  define STM32_TRACEERR_IRQREGISTRATION      0x19
#  define STM32_TRACEERR_NOEP                 0x1a
#  define STM32_TRACEERR_NOTCONFIGURED        0x1b
#  define STM32_TRACEERR_EPOUTQEMPTY          0x1c
#  define STM32_TRACEERR_EPINREQEMPTY         0x1d
#  define STM32_TRACEERR_NOOUTSETUP           0x1e
#  define STM32_TRACEERR_POLLTIMEOUT          0x1f

/* Trace interrupt codes */

#  define STM32_TRACEINTID_USB                1 /* USB Interrupt entry/exit */
#  define STM32_TRACEINTID_INTPENDING         2 /* On each pass through the
                                                 * loop */

#  define STM32_TRACEINTID_EPOUT              (10 + 0)  /* First level
                                                         * interrupt decode */
#  define STM32_TRACEINTID_EPIN               (10 + 1)
#  define STM32_TRACEINTID_MISMATCH           (10 + 2)
#  define STM32_TRACEINTID_WAKEUP             (10 + 3)
#  define STM32_TRACEINTID_SUSPEND            (10 + 4)
#  define STM32_TRACEINTID_SOF                (10 + 5)
#  define STM32_TRACEINTID_RXFIFO             (10 + 6)
#  define STM32_TRACEINTID_DEVRESET           (10 + 7)
#  define STM32_TRACEINTID_ENUMDNE            (10 + 8)
#  define STM32_TRACEINTID_IISOIXFR           (10 + 9)
#  define STM32_TRACEINTID_IISOOXFR           (10 + 10)
#  define STM32_TRACEINTID_SRQ                (10 + 11)
#  define STM32_TRACEINTID_OTG                (10 + 12)

#  define STM32_TRACEINTID_EPOUT_XFRC         (40 + 0)  /* EPOUT second level
                                                         * decode */
#  define STM32_TRACEINTID_EPOUT_EPDISD       (40 + 1)
#  define STM32_TRACEINTID_EPOUT_SETUP        (40 + 2)
#  define STM32_TRACEINTID_DISPATCH           (40 + 3)

#  define STM32_TRACEINTID_GETSTATUS          (50 + 0)  /* EPOUT third level
                                                         * decode */
#  define STM32_TRACEINTID_EPGETSTATUS        (50 + 1)
#  define STM32_TRACEINTID_DEVGETSTATUS       (50 + 2)
#  define STM32_TRACEINTID_IFGETSTATUS        (50 + 3)
#  define STM32_TRACEINTID_CLEARFEATURE       (50 + 4)
#  define STM32_TRACEINTID_SETFEATURE         (50 + 5)
#  define STM32_TRACEINTID_SETADDRESS         (50 + 6)
#  define STM32_TRACEINTID_GETSETDESC         (50 + 7)
#  define STM32_TRACEINTID_GETCONFIG          (50 + 8)
#  define STM32_TRACEINTID_SETCONFIG          (50 + 9)
#  define STM32_TRACEINTID_GETSETIF           (50 + 10)
#  define STM32_TRACEINTID_SYNCHFRAME         (50 + 11)

#  define STM32_TRACEINTID_EPIN_XFRC          (70 + 0)  /* EPIN second level
                                                         * decode */
#  define STM32_TRACEINTID_EPIN_TOC           (70 + 1)
#  define STM32_TRACEINTID_EPIN_ITTXFE        (70 + 2)
#  define STM32_TRACEINTID_EPIN_EPDISD        (70 + 3)
#  define STM32_TRACEINTID_EPIN_TXFE          (70 + 4)

#  define STM32_TRACEINTID_EPIN_EMPWAIT       (80 + 0)  /* EPIN second level
                                                         * decode */

#  define STM32_TRACEINTID_OUTNAK             (90 + 0)  /* RXFLVL second level
                                                         * decode */
#  define STM32_TRACEINTID_OUTRECVD           (90 + 1)
#  define STM32_TRACEINTID_OUTDONE            (90 + 2)
#  define STM32_TRACEINTID_SETUPDONE          (90 + 3)
#  define STM32_TRACEINTID_SETUPRECVD         (90 + 4)

/* Endpoints ****************************************************************/

/* Odd physical endpoint numbers are IN; even are OUT */

#  define STM32_EPPHYIN2LOG(epphy)     ((uint8_t)(epphy)|USB_DIR_IN)
#  define STM32_EPPHYOUT2LOG(epphy)    ((uint8_t)(epphy)|USB_DIR_OUT)

