apache/nuttx/arch/arm/src/stm32f7/stm32_otgdev.c
/* Endpoint request submission */

static int stm32_ep_submit(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int stm32_ep_cancel(struct usbdev_ep_s *ep,
                           struct usbdev_req_s *req);

/* Stall handling */

static int stm32_epout_setstall(struct stm32_ep_s *privep);
static int stm32_epin_setstall(struct stm32_ep_s *privep);
static int stm32_ep_setstall(struct stm32_ep_s *privep);
static int stm32_ep_clrstall(struct stm32_ep_s *privep);
static int stm32_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void stm32_ep0_stall(struct stm32_usbdev_s *priv);

/* Endpoint allocation */

static struct usbdev_ep_s *stm32_ep_alloc(struct usbdev_s *dev,
                                          uint8_t epno, bool in,
                                          uint8_t eptype);
static void stm32_ep_free(struct usbdev_s *dev,
                          struct usbdev_ep_s *ep);

/* USB device controller operations *****************************************/

static int stm32_getframe(struct usbdev_s *dev);
static int stm32_wakeup(struct usbdev_s *dev);
static int stm32_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int stm32_pullup(struct usbdev_s *dev, bool enable);
static void stm32_setaddress(struct stm32_usbdev_s *priv, uint16_t address);
static int stm32_txfifo_flush(uint32_t txfnum);
static int stm32_rxfifo_flush(void);

/* Initialization ***********************************************************/

static void stm32_swinitialize(struct stm32_usbdev_s *priv);
static void stm32_hwinitialize(struct stm32_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct stm32_usbdev_s g_otghsdev;

static const struct usbdev_epops_s g_epops =
{
  .configure = stm32_ep_configure,
  .disable = stm32_ep_disable,
  .allocreq = stm32_ep_allocreq,
  .freereq = stm32_ep_freereq,
#  ifdef CONFIG_USBDEV_DMA
  .allocbuffer = stm32_ep_allocbuffer,
  .freebuffer = stm32_ep_freebuffer,
#  endif
  .submit = stm32_ep_submit,
  .cancel = stm32_ep_cancel,
  .stall = stm32_ep_stall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep = stm32_ep_alloc,
  .freeep = stm32_ep_free,
  .getframe = stm32_getframe,
  .wakeup = stm32_wakeup,
  .selfpowered = stm32_selfpowered,
  .pullup = stm32_pullup,
};

/* Device error strings that may be enabled for more descriptive USB trace
 * output.
 */

#  ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(STM32_TRACEERR_ALLOCFAIL),
  TRACE_STR(STM32_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(STM32_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(STM32_TRACEERR_BADEPNO),
  TRACE_STR(STM32_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(STM32_TRACEERR_BADGETCONFIG),
  TRACE_STR(STM32_TRACEERR_BADGETSETDESC),
  TRACE_STR(STM32_TRACEERR_BADGETSTATUS),
  TRACE_STR(STM32_TRACEERR_BADSETADDRESS),
  TRACE_STR(STM32_TRACEERR_BADSETCONFIG),
  TRACE_STR(STM32_TRACEERR_BADSETFEATURE),
  TRACE_STR(STM32_TRACEERR_BADTESTMODE),
  TRACE_STR(STM32_TRACEERR_BINDFAILED),
  TRACE_STR(STM32_TRACEERR_DISPATCHSTALL),
  TRACE_STR(STM32_TRACEERR_DRIVER),
  TRACE_STR(STM32_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(STM32_TRACEERR_EP0NOSETUP),
  TRACE_STR(STM32_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(STM32_TRACEERR_EPINNULLPACKET),
  TRACE_STR(STM32_TRACEERR_EPINUNEXPECTED),
  TRACE_STR(STM32_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(STM32_TRACEERR_EPOUTUNEXPECTED),
  TRACE_STR(STM32_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(STM32_TRACEERR_INVALIDPARMS),
  TRACE_STR(STM32_TRACEERR_IRQREGISTRATION),
  TRACE_STR(STM32_TRACEERR_NOEP),
  TRACE_STR(STM32_TRACEERR_NOTCONFIGURED),
  TRACE_STR(STM32_TRACEERR_EPOUTQEMPTY),
  TRACE_STR(STM32_TRACEERR_EPINREQEMPTY),
  TRACE_STR(STM32_TRACEERR_NOOUTSETUP),
  TRACE_STR(STM32_TRACEERR_POLLTIMEOUT),
  TRACE_STR_END
};
#  endif

/* Interrupt event strings that may be enabled for more descriptive USB trace
 * output.
 */

#  ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(STM32_TRACEINTID_USB),
  TRACE_STR(STM32_TRACEINTID_INTPENDING),
  TRACE_STR(STM32_TRACEINTID_EPOUT),
  TRACE_STR(STM32_TRACEINTID_EPIN),
  TRACE_STR(STM32_TRACEINTID_MISMATCH),
  TRACE_STR(STM32_TRACEINTID_WAKEUP),
  TRACE_STR(STM32_TRACEINTID_SUSPEND),
  TRACE_STR(STM32_TRACEINTID_SOF),
  TRACE_STR(STM32_TRACEINTID_RXFIFO),
  TRACE_STR(STM32_TRACEINTID_DEVRESET),
  TRACE_STR(STM32_TRACEINTID_ENUMDNE),
  TRACE_STR(STM32_TRACEINTID_IISOIXFR),
  TRACE_STR(STM32_TRACEINTID_IISOOXFR),
  TRACE_STR(STM32_TRACEINTID_SRQ),
  TRACE_STR(STM32_TRACEINTID_OTG),
  TRACE_STR(STM32_TRACEINTID_EPOUT_XFRC),
  TRACE_STR(STM32_TRACEINTID_EPOUT_EPDISD),
  TRACE_STR(STM32_TRACEINTID_EPOUT_SETUP),
  TRACE_STR(STM32_TRACEINTID_DISPATCH),
  TRACE_STR(STM32_TRACEINTID_GETSTATUS),
  TRACE_STR(STM32_TRACEINTID_EPGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_IFGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_CLEARFEATURE),
  TRACE_STR(STM32_TRACEINTID_SETFEATURE),
  TRACE_STR(STM32_TRACEINTID_SETADDRESS),
  TRACE_STR(STM32_TRACEINTID_GETSETDESC),
  TRACE_STR(STM32_TRACEINTID_GETCONFIG),
  TRACE_STR(STM32_TRACEINTID_SETCONFIG),
  TRACE_STR(STM32_TRACEINTID_GETSETIF),
  TRACE_STR(STM32_TRACEINTID_SYNCHFRAME),
  TRACE_STR(STM32_TRACEINTID_EPIN_XFRC),
  TRACE_STR(STM32_TRACEINTID_EPIN_TOC),
  TRACE_STR(STM32_TRACEINTID_EPIN_ITTXFE),
  TRACE_STR(STM32_TRACEINTID_EPIN_EPDISD),
  TRACE_STR(STM32_TRACEINTID_EPIN_TXFE),
  TRACE_STR(STM32_TRACEINTID_EPIN_EMPWAIT),
  TRACE_STR(STM32_TRACEINTID_OUTNAK),
  TRACE_STR(STM32_TRACEINTID_OUTRECVD),
  TRACE_STR(STM32_TRACEINTID_OUTDONE),
  TRACE_STR(STM32_TRACEINTID_SETUPDONE),
  TRACE_STR(STM32_TRACEINTID_SETUPRECVD),
  TRACE_STR_END
};
