apache/nuttx/arch/arm/src/stm32f7/stm32_otgdev.c
  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: stm32_rxfifo_flush
 *
 * Description:
 *   Flush the RX fifo.
 *
 ****************************************************************************/

static int stm32_rxfifo_flush(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  stm32_putreg(OTG_GRSTCTL_RXFFLSH, STM32_OTG_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < STM32_FLUSH_DELAY; timeout++)
    {
      regval = stm32_getreg(STM32_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_RXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: stm32_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void stm32_swinitialize(struct stm32_usbdev_s *priv)
{
  struct stm32_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct stm32_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

  priv->epavail[0] = STM32_EP_AVAILABLE;
  priv->epavail[1] = STM32_EP_AVAILABLE;

  /* Initialize the endpoint lists */

  for (i = 0; i < STM32_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not really
       * necessary because there is only one controller), and the physical
       * endpoint number (which is just the index to the endpoint).
       */

      privep = &priv->epin[i];
      privep->ep.ops = &g_epops;
      privep->dev = priv;
      privep->isin = 1;

      /* The index, i, is the physical endpoint address; Map this to a
       * logical endpoint address usable by the class driver.
       */

      privep->epphy = i;
      privep->ep.eplog = STM32_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }

  /* Initialize the endpoint lists */

  for (i = 0; i < STM32_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not really
       * necessary because there is only one controller), and the physical
       * endpoint number (which is just the index to the endpoint).
       */

      privep = &priv->epout[i];
      privep->ep.ops = &g_epops;
      privep->dev = priv;

      /* The index, i, is the physical endpoint address; Map this to a
       * logical endpoint address usable by the class driver.
       */

      privep->epphy = i;
      privep->ep.eplog = STM32_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }
}

/****************************************************************************
 * Name: stm32_hwinitialize
 *
 * Description:
 *   Configure the OTG  core for operation.
 *
 ****************************************************************************/

static void stm32_hwinitialize(struct stm32_usbdev_s *priv)
{
  uint32_t regval;
  uint32_t timeout;
  uint32_t address;
  int i;

  /* At start-up the core is in FS/HS mode. */

  /* Disable global interrupts by clearing the GINTMASK bit in the GAHBCFG
   * register; Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
   * interrupts will occur when the TxFIFO is truly empty (not just half
   * full).
   */

  stm32_putreg(OTG_GAHBCFG_TXFELVL, STM32_OTG_GAHBCFG);

#  ifdef CONFIG_STM32_OTGFSHS

#    ifdef CONFIG_STM32_NO_ULPI

  regval = stm32_getreg(STM32_OTG_GUSBCFG);
  regval |= OTG_GUSBCFG_PHYSEL;
  stm32_putreg(regval, STM32_OTG_GUSBCFG);

#    else /* CONFIG_STM32_NO_ULPI */

  /* Switch off FS transceiver */

  regval = stm32_getreg(STM32_OTG_GCCFG);
  regval &= ~(OTG_GCCFG_PWRDWN);
  stm32_putreg(regval, STM32_OTG_GCCFG);

  /* Init The ULPI Interface: Set the PHYSEL bit in the GUSBCFG register to
   * select the OTG HS serial 0: USB 2.0 external ULPI high-speed PHY or
   * internal UTMI high-speed PHY" 1: USB 1.1 full-speed serial transceiver
   */

  regval = stm32_getreg(STM32_OTG_GUSBCFG);
  regval &= ~(OTG_GUSBCFG_TSDPS | OTG_GUSBCFG_ULPIFSLS | OTG_GUSBCFG_PHYSEL);
  stm32_putreg(regval, STM32_OTG_GUSBCFG);

  /* Select vbus source */

  regval = stm32_getreg(STM32_OTG_GUSBCFG);
  regval &= ~(OTG_GUSBCFG_ULPIEVBUSD | OTG_GUSBCFG_ULPIEVBUSI);
  stm32_putreg(regval, STM32_OTG_GUSBCFG);

#      ifdef CONFIG_STM32_INTERNAL_ULPI

  /* Select UTMI/ULPI Interface */

  regval = stm32_getreg(STM32_OTG_GUSBCFG);
  regval &= ~OTG_GUSBCFG_ULPISEL;
  stm32_putreg(regval, STM32_OTG_GUSBCFG);

  /* Not in datasheet but in stmcube ? */

  regval = stm32_getreg(STM32_OTG_GCCFG);
  regval |= OTG_GCCFG_PHYHSEN;
  stm32_putreg(regval, STM32_OTG_GCCFG);

  /* Enable LDO */

  stm32_putreg(USBPHYC_LDO_ENABLE, STM32_USBPHYC_LDO);

  /* wait for LDO Ready */

  while (!(stm32_getreg(STM32_USBPHYC_LDO) & USBPHYC_LDO_STATUS));

  /* Controls PHY frequency operation selection */

  stm32_putreg(USBPHYC_PLL1_SEL_25MHz, STM32_USBPHYC_PLL1);

  /* Control the tuning interface of the High Speed PHY */

  regval = stm32_getreg(STM32_USBPHYC_TUNE);

  /* TODO set right value */

  regval |= 0x00000f13;
  stm32_putreg(regval, STM32_USBPHYC_TUNE);

  /* Enable PLL internal PHY */

  regval = stm32_getreg(STM32_USBPHYC_PLL1);
  regval |= USBPHYC_PLL1_EN;
  stm32_putreg(regval, STM32_USBPHYC_PLL1);

  /* 2ms delay required for clk to be stable */

  up_udelay(2000);

#      endif /* CONFIG_STM32_INTERNAL_ULPI */
#    endif   /* CONFIG_STM32_NO_ULPI */
#  endif     /* CONFIG_STM32_OTGFSHS */

  /* Common USB OTG core initialization */

  /* Reset after a PHY select and set Host mode.  First, wait for AHB master
   * IDLE state.
   */

  for (timeout = 0; timeout < STM32_READY_DELAY; timeout++)
    {
      up_udelay(3);
      regval = stm32_getreg(STM32_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_AHBIDL) != 0)
        {
          break;
        }
    }

  /* Then perform the core soft reset. */

  regval = stm32_getreg(STM32_OTG_GRSTCTL);
  regval |= OTG_GRSTCTL_CSRST;
  stm32_putreg(regval, STM32_OTG_GRSTCTL);
  for (timeout = 0; timeout < STM32_READY_DELAY; timeout++)
    {
      regval = stm32_getreg(STM32_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_CSRST) == 0)
        {
          break;
        }
    }

